window.keymap = {
	"あ": ["a"]
	"い": ["i", "yi"]
	"う": ["u", "wu", "whu"]
	"え": ["e"]
	"お": ["o"]
	"うぁ": ["wha"]
	"うぃ": ["whi", "wi"]
	"うぇ": ["whe", "we"]
	"うぉ": ["who"]
	"ゐ": ["wi"]
	"ゑ": ["we"]
	"ぁ": ["la", "xa"]
	"ぃ": ["li", "xi", "lyi", "xy"]
	"ぅ": ["lu", "xu"]
	"ぇ": ["le", "xe", "lye", "xy"]
	"ぉ": ["lo", "xo"]
	"ぃぇ": ["ye"]
	"か": ["ka", "ca"]
	"き": ["ki"]
	"く": ["ku", "cu", "qu"]
	"け": ["ke"]
	"こ": ["ko", "co"]
	"きゃ": ["kya"]
	"きぃ": ["kyi"]
	"きゅ": ["kyu"]
	"きぇ": ["kye"]
	"きょ": ["kyo"]
	"くゃ": ["qya"]
	"くゅ": ["qyu"]
	"くょ": ["qyo"]
	"くぁ": ["qwa", "qa", "kwa"]
	"くぃ": ["qwi", "qi", "qyi"]
	"くぅ": ["qwu"]
	"くぇ": ["qwe", "qe", "qye"]
	"くぉ": ["qwo", "qo"]
	"が": ["ga"]
	"ぎ": ["gi"]
	"ぐ": ["gu"]
	"げ": ["ge"]
	"ご": ["go"]
	"ぎゃ": ["gya"]
	"ぎぃ": ["gyi"]
	"ぎゅ": ["gyu"]
	"ぎぇ": ["gye"]
	"ぎょ": ["gyo"]
	"ぐぁ": ["gwa"]
	"ぐぃ": ["gwi"]
	"ぐぅ": ["gwu"]
	"ぐぇ": ["gwe"]
	"ぐぉ": ["gwo"]
	"ヵ": ["lka", "xka"]
	"ヶ": ["lke", "xke"]
	"さ": ["sa"]
	"し": ["si", "ci", "shi"]
	"す": ["su"]
	"せ": ["se", "ce"]
	"そ": ["so"]
	"しゃ": ["sya", "sha"]
	"しぃ": ["syi"]
	"しゅ": ["syu", "shu"]
	"しぇ": ["sye", "she"]
	"しょ": ["syo", "sho"]
	"すぁ": ["swa"]
	"すぃ": ["swi"]
	"すぅ": ["swu"]
	"すぇ": ["swe"]
	"すぉ": ["swo"]
	"ざ": ["za"]
	"じ": ["zi", "ji"]
	"ず": ["zu"]
	"ぜ": ["ze"]
	"ぞ": ["zo"]
	"じゃ": ["zya", "ja", "jya"]
	"じぃ": ["zyi", "jyi"]
	"じゅ": ["zyu", "ju", "jyu"]
	"じぇ": ["zye", "je", "jye"]
	"じょ": ["zyo", "jo", "jyo"]
	"た": ["ta"]
	"ち": ["ti", "chi"]
	"つ": ["tu", "tsu"]
	"て": ["te"]
	"と": ["to"]
	"ちゃ": ["tya", "cha", "cya"]
	"ちぃ": ["tyi", "cyi"]
	"ちゅ": ["tyu", "chu", "cyu"]
	"ちぇ": ["tye", "che", "cye"]
	"ちょ": ["tyo", "cho", "cyo"]
	"つぁ": ["tsa"]
	"つぃ": ["tsi"]
	"つぇ": ["tse"]
	"つぉ": ["tso"]
	"てゃ": ["tha"]
	"てぃ": ["thi"]
	"てゅ": ["thu"]
	"てぇ": ["the"]
	"てょ": ["tho"]
	"とぁ": ["twa"]
	"とぃ": ["twi"]
	"とぅ": ["twu"]
	"とぇ": ["twe"]
	"とぉ": ["two"]
	"だ": ["da"]
	"ぢ": ["di"]
	"づ": ["du"]
	"で": ["de"]
	"ど": ["do"]
	"ぢゃ": ["dya"]
	"ぢぃ": ["dyi"]
	"ぢゅ": ["dyu"]
	"ぢぇ": ["dye"]
	"ぢょ": ["dyo"]
	"でゃ": ["dha"]
	"でぃ": ["dhi"]
	"でゅ": ["dhu"]
	"でぇ": ["dhe"]
	"でょ": ["dho"]
	"どぁ": ["dwa"]
	"どぃ": ["dwi"]
	"どぅ": ["dwu"]
	"どぇ": ["dwe"]
	"どぉ": ["dwo"]
	"っ": ["ltu", "xtu", "ltsu"]
	"な": ["na"]
	"に": ["ni"]
	"ぬ": ["nu"]
	"ね": ["ne"]
	"の": ["no"]
	"にゃ": ["nya"]
	"にぃ": ["nyi"]
	"にゅ": ["nyu"]
	"にぇ": ["nye"]
	"にょ": ["nyo"]
	"は": ["ha"]
	"ひ": ["hi"]
	"ふ": ["hu", "fu"]
	"へ": ["he"]
	"ほ": ["ho"]
	"ひゃ": ["hya"]
	"ひぃ": ["hyi"]
	"ひゅ": ["hyu"]
	"ひぇ": ["hye"]
	"ひょ": ["hyo"]
	"ふぁ": ["fwa", "fa"]
	"ふぃ": ["fwi", "fi", "fyi"]
	"ふぅ": ["fwu"]
	"ふぇ": ["fwe", "fe", "fye"]
	"ふぉ": ["fwo", "fo"]
	"ふゃ": ["fya"]
	"ふゅ": ["fyu"]
	"ふょ": ["fyo"]
	"ば": ["ba"]
	"び": ["bi"]
	"ぶ": ["bu"]
	"べ": ["be"]
	"ぼ": ["bo"]
	"びゃ": ["bya"]
	"びぃ": ["byi"]
	"びゅ": ["byu"]
	"びぇ": ["bye"]
	"びょ": ["byo"]
	"ヴぁ": ["va"]
	"ヴぃ": ["vi"]
	"ヴ": ["vu"]
	"ヴぇ": ["ve"]
	"ヴぉ": ["vo"]
	"ヴゃ": ["vya"]
	"ヴぃ": ["vyi"]
	"ヴゅ": ["vyu"]
	"ヴぇ": ["vye"]
	"ヴょ": ["vyo"]
	"ぱ": ["pa"]
	"ぴ": ["pi"]
	"ぷ": ["pu"]
	"ぺ": ["pe"]
	"ぽ": ["po"]
	"ぴゃ": ["pya"]
	"ぴぃ": ["pyi"]
	"ぴゅ": ["pyu"]
	"ぴぇ": ["pye"]
	"ぴょ": ["pyo"]
	"ま": ["ma"]
	"み": ["mi"]
	"む": ["mu"]
	"め": ["me"]
	"も": ["mo"]
	"みゃ": ["mya"]
	"みぃ": ["myi"]
	"みゅ": ["myu"]
	"みぇ": ["mye"]
	"みょ": ["myo"]
	"や": ["ya"]
	"ゆ": ["yu"]
	"よ": ["yo"]
	"ゃ": ["lya", "xya"]
	"ゅ": ["lyu", "xyu"]
	"ょ": ["lyo", "xyo"]
	"ら": ["ra"]
	"り": ["ri"]
	"る": ["ru"]
	"れ": ["re"]
	"ろ": ["ro"]
	"りゃ": ["rya"]
	"りぃ": ["ryi"]
	"りゅ": ["ryu"]
	"りぇ": ["rye"]
	"りょ": ["ryo"]
	"わ": ["wa"]
	"を": ["wo"]
	"ん": ["n", "nn", "n'", "x"]
	"ゎ": ["lwa", "xwa"]
	"ー": ["-"]
}

window.words = {
	"初音ミク": "はつねみく"
	"時代祭": "じだいまつり"
	"明治大学": "めいじだいがく"
	"チャールズ": "ちゃーるず"
	"中原中也": "はかはらちゅうや"
	"岩波書店": "いわなみしょてん"
	"みすず書房": "みすずしょぼう"
	"ゴジラ": "ごじら"
	"タケカワユキヒデ": "たけかわゆきひで"
	"フランツリスト": "ふらんつりすと"
	"クリストファーロイド": "くりすとふぁーろいど"
	"ルパン三世": "るぱんさんせい"
	"Kindle": "きんどる"
	"Blogger": "ぶろがー"
	"Safari": "さふぁり"
	"Linux": "りなっくす"
	"マイクロソフト": "まいくろそふと"
	"脆弱性": "ぜいじゃくせい"
	"ビオラ": "びおら"
	"シクラメン": "しくらめん"
	"VS嵐": "ぶいえすあらし"
	"NHK教育テレビジョン": "えぬえいちけーきょういくてれびじょん"
	"おはスタ": "おはすた"
	"Dance with Devils": "だんすうぃずでびる"
	"アイカツ": "あいかつ"
	"ご注文はうさぎですか": "ごちゅうもんはうさぎですか"
	"ベジタリアン": "べじたりあん"
	"サイリウム": "さいりうむ"
	"ドカベン": "どかべん"
	"イチロー": "いちろー"
	"国際サッカー連盟": "こくさいさっかーれんめい"
	"Jリーグ": "じぇいりーぐ"
	"花札": "はなふだ"
	"任天堂": "にんてんどう"
	"ニャオニクス": "にゃおにくす"
	"ガンプラ": "がんぷら"
	"Perfume": "ぱふぃうむ"
	"榮倉奈々": "えいくらなな"
	"石橋杏奈": "いしばしあんな"
	"チャーチル": "ちゃーちる"
	"厚生労働省": "こうせいろうどうしょう"
	"違憲": "いけん"
	"JR東日本": "じぇいあーるひがしにほん"
	"南沙諸島": "なんさしょとう"
	"チベット": "ちべっと"
	"伊藤沙莉": "いとうさいり"
	"室井滋": "むろいしげる"
	"伊藤淳史": "いとうあつし"
	"小惑星": "しょうわくせい"
	"うつ病": "うつびょう"
	"プルトニウム": "ぷるとにうむ"
}


